{
  "quem é o naruto?": "Naruto Uzumaki é o protagonista do anime e um ninja da Vila da Folha.",
  "quem é o sasuke?": "Sasuke Uchiha é um ninja do clã Uchiha e rival de Naruto.",
  "quem é o kakashi?": "Kakashi Hatake é o sensei do Time 7 e conhecido como o Ninja Copiador.",
  "quem é o sakura?": "Sakura Haruno é uma ninja médica e membro do Time 7.",
  "quem é o jiraiya?": "Jiraiya é um dos Três Sannin Lendários e mestre de Naruto.",
  "quem é o itachi?": "Itachi Uchiha é irmão de Sasuke e foi membro da Akatsuki.",
  "quem é o orochimaru?": "Orochimaru é um dos Três Sannin e um dos principais vilões da série.",
  "quem é o minato?": "Minato Namikaze foi o Quarto Hokage e pai de Naruto.",
  "quem é o hashirama?": "Hashirama Senju foi o Primeiro Hokage e fundador da Vila da Folha.",
  "quem é o madara?": "Madara Uchiha foi cofundador da Vila da Folha e rival de Hashirama.",
  "o que é o sharingan?": "Sharingan é uma habilidade ocular do clã Uchiha.",
  "o que é o byakugan?": "Byakugan é uma habilidade ocular do clã Hyuuga.",
  "o que é o rinnegan?": "Rinnegan é uma das técnicas oculares mais poderosas do mundo ninja.",
  "o que é o rasengan?": "Rasengan é uma técnica de rotação de chakra criada por Minato.",
  "o que é o chidori?": "Chidori é uma técnica de elemento raio criada por Kakashi.",
  "quem é o rock lee?": "Rock Lee é um ninja da Vila da Folha que não usa ninjutsu.",
  "quem é o neji?": "Neji Hyuuga é um gênio do clã Hyuuga e primo de Hinata.",
  "quem é o gaara?": "Gaara é um ninja da Vila da Areia e jinchūriki do Shukaku.",
  "quem é a hinata?": "Hinata Hyuuga é uma ninja tímida do clã Hyuuga e interesse amoroso de Naruto.",
  "quem é o shikamaru?": "Shikamaru Nara é um ninja estrategista e muito inteligente.",
  "quem é o choji?": "Choji Akimichi é um ninja com habilidades de expansão corporal.",
  "quem é a ino?": "Ino Yamanaka é uma kunoichi do Clã Yamanaka e amiga de Sakura.",
  "quem é o kiba?": "Kiba Inuzuka é um ninja que luta ao lado de seu cão Akamaru.",
  "quem é o shino?": "Shino Aburame é um ninja que controla insetos.",
  "quem é o sai?": "Sai é um membro da ANBU que substitui Sasuke no Time 7.",
  "quem é a tsunade?": "Tsunade é uma das Três Sannin e a Quinta Hokage.",
  "quem é o danzo?": "Danzō Shimura foi líder da Raiz e atuou nos bastidores da Vila da Folha.",
  "quem são os hokages?": "Os Hokages são os líderes da Vila da Folha.",
  "quem é o zabuza?": "Zabuza Momochi foi um dos Sete Espadachins da Névoa.",
  "quem é a haku?": "Haku era o parceiro leal de Zabuza com habilidades de gelo.",
  "quem é o killer bee?": "Killer Bee é o jinchūriki do Oito-Caudas e um rapper ninja.",
  "quem é o nagato?": "Nagato é o verdadeiro Pain e portador do Rinnegan.",
  "quem é o konan?": "Konan foi membro da Akatsuki e parceira de Nagato.",
  "quem é o obito?": "Obito Uchiha é um ninja que se tornou Tobi e vilão central de Naruto.",
  "quem é o tobi?": "Tobi é uma identidade usada por Obito Uchiha.",
  "quem é o yamato?": "Yamato é um ninja da ANBU que consegue usar o Estilo Madeira.",
  "quem é o iruka?": "Iruka Umino foi o primeiro professor que acreditou em Naruto.",
  "o que é a akatsuki?": "Akatsuki é uma organização de ninjas renegados que caça bijuus.",
  "o que é uma bijuu?": "Bijuu são bestas com cauda de chakra imenso.",
  "quem é o kurama?": "Kurama é a Raposa de Nove Caudas selada em Naruto.",
  "quem é o shukaku?": "Shukaku é a Bijuu de Uma Cauda selada em Gaara.",
  "o que é o exame chuunin?": "O Exame Chuunin é uma prova para promover ninjas Genin.",
  "quem venceu o exame chuunin?": "Nenhum dos personagens principais venceu formalmente o exame devido à invasão.",
  "quem é o kabuto?": "Kabuto Yakushi foi assistente de Orochimaru e tornou-se um vilão.",
  "o que é a vila da folha?": "A Vila da Folha é uma das cinco grandes vilas ninjas.",
  "quantas grandes nações existem?": "Existem cinco grandes nações shinobi.",
  "o que é um jounin?": "Jounin é um nível alto de ninja experiente.",
  "o que é um genin?": "Genin é o nível mais baixo da hierarquia ninja.",
  "o que é o sannin?": "Sannin são três ninjas lendários: Jiraiya, Tsunade e Orochimaru.",
  "quem é o terceiro hokage?": "Hiruzen Sarutobi foi o Terceiro Hokage da Vila da Folha.",
  "quem é o asuma?": "Asuma Sarutobi foi um Jounin da Vila da Folha e líder do Time 10.",
  "quem é o kurenai?": "Kurenai Yuhi é uma Jounin especializada em Genjutsu e líder do Time 8.",
  "quem é o guy?": "Might Guy é um Jounin especialista em Taijutsu e rival de Kakashi.",
  "quem é o tenten?": "Tenten é uma kunoichi do Time Guy especializada em armas.",
  "quem é o jiraya?": "Jiraiya é um dos Três Sannin Lendários e mestre de Naruto.",
  "quem é o temari?": "Temari é uma ninja da Vila da Areia e irmã de Gaara.",
  "quem é o kankuro?": "Kankuro é um ninja da Vila da Areia especialista em marionetes.",
  "quem é o yahiko?": "Yahiko foi um dos fundadores da Akatsuki original e amigo de Nagato.",
  "quem é o kaguya?": "Kaguya Ōtsutsuki é considerada a progenitora do chakra no mundo shinobi.",
  "quem é o indra?": "Indra Ōtsutsuki é o filho mais velho de Hagoromo e antecessor dos Uchihas.",
  "quem é o asura?": "Asura Ōtsutsuki é o filho mais novo de Hagoromo e antecessor dos Senjus.",
  "quem é o hagoromo?": "Hagoromo Ōtsutsuki é o Sábio dos Seis Caminhos e fundador do ninjutsu.",
  "quem é o hamura?": "Hamura Ōtsutsuki é irmão de Hagoromo e antecessor do clã Hyuuga.",
  "quem é o tobirama?": "Tobirama Senju foi o Segundo Hokage e irmão de Hashirama.",
  "quem é o hiruzen?": "Hiruzen Sarutobi foi o Terceiro Hokage conhecido como o Professor.",
  "quem é o konohamaru?": "Konohamaru Sarutobi é neto do Terceiro Hokage e aluno de Naruto.",
  "quem é o shikaku?": "Shikaku Nara foi o pai de Shikamaru e estrategista da Vila da Folha.",
  "quem é o choza?": "Chōza Akimichi é o pai de Chōji e membro do Clã Akimichi.",
  "quem é o hiashi?": "Hiashi Hyuuga é o líder do Clã Hyuuga e pai de Hinata.",
  "quem é o kakuzu?": "Kakuzu foi membro da Akatsuki e parceiro de Hidan.",
  "quem é o hidan?": "Hidan foi membro da Akatsuki com habilidades imortais.",
  "quem é o kisame?": "Kisame Hoshigaki foi parceiro de Itachi na Akatsuki e portador da Samehada.",
  "quem é o deidara?": "Deidara foi um membro da Akatsuki especialista em argila explosiva.",
  "quem é o sasori?": "Sasori foi um mestre de marionetes e membro da Akatsuki.",
  "quem é o zetsu?": "Zetsu foi um espião da Akatsuki composto por duas entidades: Branco e Negro.",
  "quem é o juugo?": "Jūgo é um ninja com habilidades de transformação e integrante da Taka.",
  "quem é o suigetsu?": "Suigetsu Hōzuki é um espadachim da Névoa e membro da Taka.",
  "quem é a karin?": "Karin é uma ninja sensora que faz parte do Time Taka.",
  "o que é o susanoo?": "Susanoo é uma manifestação poderosa do chakra do Sharingan avançado.",
  "o que é o amaterasu?": "Amaterasu é uma chama negra invocada pelo Mangekyou Sharingan.",
  "o que é o izanagi?": "Izanagi é um genjutsu que transforma ilusões em realidade temporária.",
  "o que é o izanami?": "Izanami é um genjutsu que aprisiona o alvo em um ciclo infinito.",
  "o que é o tsukuyomi?": "Tsukuyomi é um poderoso genjutsu ocular do Mangekyou Sharingan.",
  "o que é o kamui?": "Kamui é uma técnica do Mangekyou Sharingan que permite distorção espacial.",
  "o que é o rasenshuriken?": "Rasenshuriken é uma variação do Rasengan com poder cortante extremo.",
  "o que é o modo sábio?": "Modo Sábio é um estado que combina chakra natural com chakra do usuário.",
  "o que é o modo bijuu?": "Modo Bijuu é a transformação completa do Jinchūriki com sua Besta com Cauda.",
  "quem é o momoshiki?": "Momoshiki Ōtsutsuki é um vilão poderoso que enfrenta Naruto e Sasuke.",
  "quem é o kinshiki?": "Kinshiki Ōtsutsuki é parceiro de Momoshiki e possui grande força física.",
  "quem é o urashiki?": "Urashiki Ōtsutsuki é um membro do clã Ōtsutsuki que coleta chakra.",
  "quem é o kawaki?": "Kawaki é um personagem de Boruto que se torna próximo da família Uzumaki.",
  "quem é o boruto?": "Boruto Uzumaki é o filho de Naruto e protagonista de Boruto: Naruto Next Generations.",
  "quem é o sarada?": "Sarada Uchiha é filha de Sasuke e Sakura e membro do Time 7 em Boruto.",
  "quem é o mitsuki?": "Mitsuki é um clone criado por Orochimaru e companheiro de Boruto.",
  "o que é o karma?": "Karma é uma marca dos Ōtsutsuki que concede poderes extraordinários.",
  "o que é o jutsu proibido?": "Jutsus proibidos são técnicas perigosas ou moralmente condenáveis.",
  "o que é o selo amaldiçoado?": "Selo Amaldiçoado é uma técnica de Orochimaru que aumenta o poder em troca da sanidade."
}
